Repository: OpenPLC/OpenPLC-IDE
Catalog: arduino-core/src/processing/app/i18n/Resources_*.po
Languages: ru

source: (requires restart of Arduino)
ru: (нужен перезапуск Arduino)

source: 'Keyboard' only supported on the Arduino Leonardo
ru: Поддержка клавиатуры только в Arduino Leonardo

source: 'Mouse' only supported on the Arduino Leonardo
ru: Поддержка мыши только в Arduino Leonardo

source: (edit only when Arduino is not running)
ru: (редактировать, только когда Arduino не работает)

source: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Are you sure you want to Quit?</b><p>Closing the last open sketch will quit Arduino.
ru: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Вы хотите выйти?</b><p>Закрытие последнего открытого эскиза означает выход из Arduino.

source: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Do you want to save changes to this sketch<BR> before closing?</b><p>If you don't save, your changes will be lost.
ru: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Хотите-ли вы сохранить изменения в эскизе<BR> перед закрытием?</b><p>Если не сохраните, изменения будут утеряны.

source: A file named "{0}" already exists in "{1}"
ru: Файл "{0}" уже есть в "{1}"

source: A folder named "{0}" already exists. Can't open sketch.
ru: Папка "{0}" уже существует. Эскиз не открывается.

source: A library named {0} already exists
ru: Библиотека с именем {0} уже существует

source: About Arduino
ru: Об Arduino

source: Add File...
ru: Добавить файл...

source: Add Library...
ru: Добавить библиотеку...

source: An unknown error occurred while trying to load platform-specific code for your machine.
ru: Произошла неизвестная ошибка во время загрузки платформо-зависимого кода для вашей машины.

source: Arabic
ru: Арабский - Arabic

source: Archive Sketch
ru: Архивировать эскиз

source: Archive sketch as:
ru: Архивировать эскиз как:

source: Archive sketch canceled.
ru: Архивация эскиза отменена.

source: Arduino ARM (32-bits) Boards
ru: Платы Arduino ARM (32-bits)

source: Arduino AVR Boards
ru: Платы Arduino AVR

source: Arduino cannot run because it could not create a folder to store your settings.
ru: Arduino не может работать, потому что он не смог создать папку для хранения настроек.

source: Arduino cannot run because it could not create a folder to store your sketchbook.
ru: Arduino не может работать, потому что он не смог создать папку для хранения sketchbook.

source: Arduino requires a full JDK (not just a JRE) to run. Please install JDK 1.5 or later. More information can be found in the reference.
ru: Arduino требует запустить полный JDK (не только JRE). Пожалуйста, установите JDK 1.5 или более новый. Более подробную информацию можно найти в документации.

source: Are you sure you want to delete "{0}"?
ru: Вы действительно хотите удалить "{0}"?

source: Are you sure you want to delete this sketch?
ru: Вы действительно хотите удалить этот эскиз?

source: Automatically associate .ino files with Arduino
ru: Автоматически ассоциировать файлы .ino с Arduino

source: Autoscroll
ru: Автопрокрутка

source: Bad error line: {0}
ru: Плохая ошибка в строке {0}

source: Bad file selected
ru: Это плохой файл

source: Board
ru: Плата

source: Both NL & CR
ru: Оба NL & CR

source: Browse
ru: Обзор

source: Build folder disappeared or could not be written
ru: Папка сборки исчезла или не имеет доступ на запись

source: Bulgarian
ru: Болгарский - Bulgarian

source: Can't open source sketch!
ru: Невозможно открыть эскиз!

source: Canadian French
ru: Канадский Французский - Canadian French

source: Cancel
ru: Отмена

source: Cannot Rename
ru: Не переименовывается

source: Carriage return
ru: Возврат каретки

source: Catalan
ru: Каталонский - Catalan

source: Check for updates on startup
ru: Проверять обновления при запуске

source: Chinese Simplified
ru: Китайский упрощённый - Chinese Simplified

source: Chinese Traditional
ru: Китайский традиционный - Chinese Traditional

source: Close
ru: Закрыть

source: Comment/Uncomment
ru: Добавить/Удалить комментарий

source: Compiler error, please submit this code to {0}
ru: Ошибка компилятора. Пожалуйста, отправьте этот код {0}

source: Compiling sketch...
ru: Компиляция скетча...

source: Copy
ru: Копировать

source: Copy as HTML
ru: Копировать в HTML

source: Copy for Forum
ru: Копировать для форума

source: Could not add ''{0}'' to the sketch.
ru: Невозможно добавить ''{0}'' в эскиз.

source: Could not create the sketch folder.
ru: Папка для эскизов не создаётся.

source: Could not create the sketch.
ru: Эскиз не создаётся.

source: Could not delete "{0}".
ru: "{0}" не удаляется.

source: Could not delete the existing ''{0}'' file.
ru: Не возможно удалить существующий файл "{0}".

source: Could not delete {0}
ru: {0} не удаляется

source: Could not open the URL {0}
ru: URL не открывается: {0}

source: Could not open the folder {0}
ru: Папка не открывается: {0}

source: Could not properly re-save the sketch. You may be in trouble at this point, and it might be time to copy and paste your code to another text editor.
ru: Не возможно правильно пересохранить скетч. Это проблема, и самое время скопировать и вставить код в другой текстовый редактор.

source: Could not re-save sketch
ru: Эскиз не пересохраняется

source: Could not read default settings. You'll need to reinstall Arduino.
ru: Умолчания не считываются. Переустановите Arduino.

source: Could not remove old version of {0}
ru: Старая версия {0} не удаляется

source: Could not rename "{0}" to "{1}"
ru: "{0}" в "{1}" не переименовывается

source: Could not rename the sketch. (0)
ru: Невозможно переименовать эскиз. (0)

source: Could not rename the sketch. (1)
ru: Невозможно переименовать эскиз. (1)

source: Could not rename the sketch. (2)
ru: Невозможно переименовать эскиз. (2)

source: Could not replace {0}
ru: {0} не заменяется

source: Couldn't archive sketch
ru: Эскиз не архивируется

source: Couldn't determine program size: {0}
ru: Не удалось определить размер программы: {0}

source: Couldn't do it
ru: Невозможно это сделать

source: Croatian
ru: Хорватский - Croatian

source: Cut
ru: Вырезать

source: Czech
ru: Чешский - Czech

source: Danish
ru: Датский - Danish

source: Decrease Indent
ru: Уменьшить отступ

source: Delete
ru: Удалить

source: Don't Save
ru: Не сохранять

source: Done Saving.
ru: Сохранили.

source: Done compiling.
ru: Компиляция завершена

source: Done printing.
ru: Напечатали.

source: Done uploading.
ru: Вгрузили.

source: Dutch
ru: Голландский - Dutch

source: Edit
ru: Правка

source: Editor font size:
ru: Размер шрифта:

source: Editor language:
ru: Язык редактора:

source: English
ru: Английский - English

source: Error
ru: Ошибка

source: Error adding file
ru: Файл не добавился

source: Error compiling.
ru: Ошибка компиляции.

source: Error getting the Arduino data folder.
ru: Ошибка получения папки с данными Arduino

source: Error reading preferences
ru: Ошибка чтения настроек

source: Error reading the preferences file. Please delete (or move) {0} and restart Arduino.
ru: Ошибка при чтении файла настроек. Пожалуйста, удалите (или переместите) {0} и перезагрузите Arduino.

source: Error while loading code {0}
ru: Ошибка при загрузке кода {0}

source: Error while printing.
ru: Не напечаталось.

source: Estonian
ru: Эстонский - Estonian

source: Examples
ru: Образцы

source: File
ru: Файл

source: Filipino
ru: Филиппинский - Filipino

source: Find
ru: Найти

source: Find Next
ru: Найти далее

source: Find Previous
ru: Найти предыдущее

source: Find...
ru: Найти...

source: Find:
ru: Что:

source: For information on installing libraries, see: http://arduino.cc/en/Guide/Libraries
ru: За информацией по установке библиотек, курить: http://arduino.cc/en/Guide/Libraries

source: French
ru: Французский - French

source: Galician
ru: Галисийский - Galician

source: Georgian
ru: Грузинский - Georgian

source: German
ru: Немецкий - German

source: Greek
ru: Греческий - Greek

source: Hebrew
ru: Иврит - Hebrew

source: Help
ru: Помощь

source: Hindi
ru: Хинди - Hindi

source: How about saving the sketch first before trying to rename it?
ru: Как насчёт сохранения эскиза перед попыткой переименовать?

source: How very Borges of you
ru: Маяковский курит

source: Hungarian
ru: Венгерский - Hungarian

source: Ignore Case
ru: Без учёта регистра

source: Ignoring bad library name
ru: Игнорировать плохие имена библиотек

source: Ignoring sketch with bad name
ru: Игнорируем скетч с плохим именем

source: Import Library...
ru: Импорт библиотек...

source: Increase Indent
ru: Увеличить отступ

source: Indonesian
ru: Индонезийский - Indonesian

source: Italian
ru: Итальянский - Italian

source: Japanese
ru: Японский - Japanese

source: Korean
ru: Корейский - Korean

source: Latvian
ru: Латвия - Latvian

source: Library added to your libraries. Check "Import library" menu
ru: Библиотеки добавлены, смотрите меню "Импорт библиотек"

source: Lithuaninan
ru: Литовский - Lithuaninan

source: Marathi
ru: Mаратхи - Marathi

source: Message
ru: Сообщение

source: More preferences can be edited directly in the file
ru: Больше опций можно редактировать непосредственно в файле

source: Moving
ru: Перемещение

source: Name for new file:
ru: Имя для нового файла:

source: New
ru: Создать

source: New Editor Window
ru: Новое окно редактора

source: New Tab
ru: Новая вкладка

source: Newline
ru: Новая строка

source: Next Tab
ru: Следующая вкладка

source: No
ru: Нет

source: No board selected; please choose a board from the Tools > Board menu.
ru: Не выбрана плата; пожалуйста, выберите плату из меню Сервис > Плата.

source: No line ending
ru: Не найден конец строки

source: No really, time for some fresh air for you.
ru: Да хорош, пора тебе пойти проветриться.

source: Non-fatal error while setting the Look & Feel.
ru: Не критическая ошибка при установке Look & Feel.

source: Nope
ru: Нету

source: Norwegian Bokmål
ru: Норвежский - Norwegian Bokmål

source: OK
ru: ОК

source: One file added to the sketch.
ru: Один файл добавлен в эскиз.

source: Open
ru: Открыть

source: Open URL
ru: Открыть ссылку

source: Open an Arduino sketch...
ru: Открыть скетч Arduino...

source: Open in Another Window
ru: Открыть в другом окне

source: Open...
ru: Открыть...

source: Page Setup
ru: Настройки страницы

source: Paste
ru: Вставить

source: Persian
ru: Персидский - Persian

source: Please import the SPI library from the Sketch > Import Library menu.
ru: Пожалуйста импортируйте библиотеку SPI из меню Эскиз > Импорт библиотеки.

source: Please install JDK 1.5 or later
ru: Пожалуйста, установите JDK версии 1.5 или новее

source: Polish
ru: Польский -

source: Preferences
ru: Настройки

source: Previous
ru: Предыдущий

source: Previous Tab
ru: Предыдущая вкладка

source: Print
ru: Печать

source: Printing canceled.
ru: Печать отменена.

source: Printing...
ru: Печатаем...

source: Problem Opening Folder
ru: Папка не открывается

source: Problem Opening URL
ru: URL не открывается

source: Problem Setting the Platform
ru: Ошибка настройки платформы

source: Problem getting data folder
ru: Не удалось получить папку с данными

source: Problem moving {0} to the build folder
ru: Проблема с перемещением {0} в папку сборки

source: Problem uploading to board. See http://www.arduino.cc/en/Guide/Troubleshooting#upload for suggestions.
ru: Проблема загрузки на плату. Для достижения дзен, курить http://www.arduino.cc/en/Guide/Troubleshooting#upload .

source: Problem with rename
ru: Не переименовывается

source: Processor
ru: Процессор

source: Programmer
ru: Программатор

source: Quit
ru: Выход

source: Redo
ru: Повторить

source: Rename
ru: Переименовать

source: Replace
ru: Заменить

source: Replace & Find
ru: Заменить...

source: Replace All
ru: Заменить все

source: Replace the existing version of {0}?
ru: Заменить существующую версию {0}?

source: Replace with:
ru: Чем:

source: Romanian
ru: Румынский - Romanian

source: Russian
ru: Русский

source: Save
ru: Сохранить

source: Save As...
ru: Сохранить как...

source: Save Canceled.
ru: Сохранение отменено

source: Save changes before export?
ru: Сохраниться перед экспортом?

source: Save changes to "{0}"?
ru: Сохранить изменения в "{0}"?

source: Save sketch folder as...
ru: Сохранить папку скетча как...

source: Saving...
ru: Сохраняем...

source: Select (or create new) folder for sketches...
ru: Выберите (или создайте новую) папку для скетчей...

source: Select All
ru: Выделить всё

source: Select a zip file or a folder containing the library you'd like to add
ru: Выберите папку или ZIP с библиотекой, которую вы хотите добавить

source: Select an image or other data file to copy to your sketch
ru: Выберите файл, чтоб скопировать его в ваш эскиз

source: Select new sketchbook location
ru: Выберите новое расположение Sketchbook

source: Send
ru: Отправить

source: Serial Monitor
ru: Монитор последовательного порта

source: Settings issues
ru: Проблемы в настройках

source: Show Sketch Folder
ru: Показать папку эскиза

source: Show verbose output during:
ru: Показать подробный вывод:

source: Sketch
ru: Эскиз

source: Sketch Disappeared
ru: Эскиз пропал

source: Sketch Does Not Exist
ru: Эскиз не существует

source: Sketch is Read-Only
ru: Эскизы только для чтения

source: Sketch is Untitled
ru: Эскиз не назван

source: Sketch is read-only
ru: Эскиз только для чтения

source: Sketch too big; see http://www.arduino.cc/en/Guide/Troubleshooting#size for tips on reducing it.
ru: Эскиз слишком большой; глянь http://www.arduino.cc/en/Guide/Troubleshooting#size для советов по диете.

source: Sketchbook folder disappeared
ru: Исчезла папка Sketchbook

source: Sketchbook location:
ru: Размещение Sketchbook

source: Some files are marked "read-only", so you'll need to re-save the sketch in another location, and try again.
ru: Некоторые файлы помечены "только для чтения", так что повторно сохраните скетч в другое место и повторите попытку.

source: Some files are marked "read-only", so you'll need to re-save this sketch to another location.
ru: Некоторые файлы помечены "только для чтения", так что повторно сохраните этот скетч в другое место.

source: Sorry, a sketch (or folder) named "{0}" already exists.
ru: Простите, но эскиз (или папка) "{0}" уже есть.

source: Spanish
ru: Испанский - Spanish

source: Sunshine
ru: Солнечный свет

source: System Default
ru: Система по умолчанию

source: Tamil
ru: Тамильский - Tamil

source: The 'BYTE' keyword is no longer supported.
ru: Ключевое слово "BYTE" больше не поддерживается

source: The Client class has been renamed EthernetClient.
ru: Класс Client был переименован в EthernetClient.

source: The Server class has been renamed EthernetServer.
ru: Класс Server был переименован в EthernetServer.

source: The Udp class has been renamed EthernetUdp.
ru: Класс Udp был переименован EthernetUdp.

source: The error message follows, however Arduino should run fine.
ru: Произошли ошибки, но Arduino должен работать нормально.

source: The library "{0}" cannot be used. Library names must contain only basic letters and numbers. (ASCII only and no spaces, and it cannot start with a number)
ru: Библиотека "{0}" не может быть использована. Имена библиотек должны содержать только буквы и цифры. (только ASCII и без пробелов, и не может начинаться с цифры)

source: The main file can't use an extension. (It may be time for your to graduate to a "real" programming environment)
ru: Основной файл не может использовать расширение. (Возможно вам настало время, перейти к "реальной" среде программирования)

source: The name cannot start with a period.
ru: Имя не может начинаться с точки

source: The selected sketch no longer exists. You may need to restart Arduino to update the sketchbook menu.
ru: Выбранный скетч больше не существует. Возможно, вам придётся перезапустить Arduino для обновления меню Sketchbook.

source: The sketch "{0}" cannot be used. Sketch names must contain only basic letters and numbers (ASCII-only with no spaces, and it cannot start with a number). To get rid of this message, remove the sketch from {1}
ru: Скетч "{0}" не может быть использован. Название скетча должно содержать только буквы и цифры (только ASCII без пробелов, и не может начинаться с цифры). Чтобы избавиться от этого сообщения, удалите скетч из {1}

source: The sketch folder has disappeared. Will attempt to re-save in the same location, but anything besides the code will be lost.
ru: Папка скетчей исчезла. Будет попытка повторно сохранить в том же месте, но всё, кроме кода, будет потеряно.

source: The sketch name had to be modified. Sketch names can only consist of ASCII characters and numbers (but cannot start with a number). They should also be less less than 64 characters long.
ru: Имя эскиза автоматически изменено. Имя эскиза может состоять только из символов (ASCII) и цифр, и не может начинаться с цифры и быть длиннее 64 знаков

source: The sketchbook folder no longer exists. Arduino will switch to the default sketchbook location, and create a new sketchbook folder if necessary. Arduino will then stop talking about himself in the third person.
ru: Папка Sketchbook больше не существует. Arduino переключится на папку по умолчанию, и создаст новую папку Sketchbook, если потребуется. Arduino прекратит говорить о себе в третьем лице.

source: This file has already been copied to the location from which where you're trying to add it. I ain't not doin nuthin'.
ru: Этот файл уже был скопирован в место, из которого вы пытаетесь добавить его. Ничего не сделано.

source: Time for a Break
ru: Пора на перекур

source: Tools
ru: Инструменты

source: Turkish
ru: Турецкий - Turkish

source: Ukrainian
ru: Украинский - Ukrainian

source: Uncaught exception type: {0}
ru: Непойманный тип исключения: {0}

source: Undo
ru: Отменить

source: Update
ru: Обновление

source: Update sketch files to new extension on save (.pde -> .ino)
ru: Конвертировать файлы эскизов в новый формат (.pde -> .ino)

source: Upload
ru: Вгрузить

source: Upload Using Programmer
ru: Вгрузить через программатор

source: Upload canceled.
ru: Вгрузка отменена.

source: Uploading to I/O Board...
ru: Вгружаем в плату ввода-вывода...

source: Uploading...
ru: Вгружаем...

source: Use Selection For Find
ru: Искать выделенное

source: Use external editor
ru: Использовать внешний редактор

source: Verify
ru: Проверить

source: Verify / Compile
ru: Проверить / Скомпилировать

source: Verify code after upload
ru: Проверить код после вгрузки

source: Visit Arduino.cc
ru: Посетить Arduino.cc

source: Warning
ru: Предупреждение

source: Wire.send() has been renamed Wire.write().
ru: Wire.send() был переименован в Wire.write().

source: Wrap Around
ru: Обернуть

source: Wrong microcontroller found. Did you select the right board from the Tools > Board menu?
ru: Найден неправильный микроконтроллер. Вы указали правильную плату в меню Инструменты -> Плата?

source: Yes
ru: Да

source: You can't fool me
ru: Вы не можете обмануть меня :-Р

source: You can't have a .cpp file with the same name as the sketch.
ru: Имя эскиза не должно совпадать с именем файла .cpp

source: You can't rename the sketch to "{0}" because the sketch already has a .cpp file with that name.
ru: Вы не можете переименовать скетч "{0}", потому что уже есть скетч с .cpp файлом с таким именем.

source: You can't save the sketch as "{0}" because the sketch already has a .cpp file with that name.
ru: Вы не можете сохранить скетч как "{0}", потому что уже есть скетч с .cpp файлом с таким именем.

source: You cannot save the sketch into a folder inside itself. This would go on forever.
ru: Вы не можете сохранить скетч в папку внутри себя. Это приведёт к рекурсии.

source: You forgot your sketchbook
ru: Вы забыли свой этюдник

source: You've reached the limit for auto naming of new sketches for the day. How about going for a walk instead?
ru: Вы исчерпали дневной лимит автоматического именования новых скетчей. Как насчёт того, чтобы прогуляться вместо этого?

source: ZIP files or folders
ru: ZIP-файлы или папки

source: Zip doesn't contain a library
ru: В этой ZIP-папке нет библиотек

source: ".{0}" is not a valid extension.
ru: Файлы ".{0}" не поддерживаются.

source: "{0}" contains unrecognized characters.If this code was created with an older version of Processing,you may need to use Tools -> Fix Encoding & Reload to updatethe sketch to use UTF-8 encoding. If not, you may need todelete the bad characters to get rid of this warning.
ru: "{0}" содержит нераспознанные символы. Если этот код был создан в более старой версии программы, возможно, поможет использовать Сервис -> Исправить кодировку И Перезагрузить, - чтобы обновить скетч в кодировке UTF-8. Если нет, то, возможно, потребуется удалить плохие символы, чтобы избавиться от этого предупреждения.

source: As of Arduino 1.0, the 'BYTE' keyword is no longer supported. Please use Serial.write() instead.
ru: Начиная с версии 1.0, в Arduino ключевое слово "BYTE" не поддерживается. Вместо него используйте "Serial.write()"

source: As of Arduino 1.0, the Client class in the Ethernet library has been renamed to EthernetClient.
ru: Начиная с версии Arduino 1.0, класс Server в библиотеке Ethernet был переименован в EthernetServer.

source: As of Arduino 1.0, the Server class in the Ethernet library has been renamed to EthernetServer.
ru: Начиная с версии Arduino 1.0, класс Server в библиотеке Ethernet был переименован в EthernetServer.

source: As of Arduino 1.0, the Udp class in the Ethernet library has been renamed to EthernetUdp.
ru: Начиная с версии Arduino 1.0, класс Udp в библиотеке Ethernet был переименован в EthernetUdp.

source: baud
ru: бод

source: compilation
ru: Компиляция

source: createNewFile() returned false
ru: createNewFile() вернула false

source: environment
ru: окружение

source: ignoring invalid font size {0}
ru: проигнорирован неверный размер шрифта {0}

source: name is null
ru: совсем нет имени

source: removeCode: internal error.. could not find code
ru: removeCode: внутренняя ошибка... не могу найти код

source: upload
ru: Вгрузить

source: {0} files added to the sketch.
ru: {0} файлов добавлено в эскиз

source: {0} returned {1}
ru: {0} возвратил {1}
